local UI_battle_bppartner={ch={[1]={cl="UI_comp_tc3",m={[1]=4,[2]=35,[3]=1,[4]=1,[5]=0,[6]=0,},na="UI_di",t="UI",
},[2]={ch={[1]={img="crosspeak_bg_huo.png",m={[1]=0,[2]=0,[3]=1,[4]=1,[5]=0,[6]=0,},na="instance_1",t="image",
},},m={[1]=515,[2]=-129,[3]=1,[4]=1,[5]=0,[6]=0,},na="panel_huo",t="panel",
},[3]={co={color=6634528,fontName="gameFont1",fontSize=22,text="选择一个奇侠，另一个将归对方",
},h=40,m={[1]=325.25,[2]=-452,[3]=1,[4]=1,[5]=0,[6]=0,},na="txt_1",t="txt",w=492,
},[4]={ar={h=322,w=241,x=0,y=-320,
},fm={[1]={[1]={cl="UI_comp_card",m={[1]=0,[2]=-2.65,[3]=0.6,[4]=0.6,[5]=0,[6]=0,},na="UI_1",t="UI",
},},},m={[1]=286.4,[2]=-121,[3]=1,[4]=1,[5]=0,[6]=0,},na="btn_1",t="btn",
},[5]={ar={h=322,w=241,x=0,y=-320,
},fm={[1]={[1]={cl="UI_comp_card",m={[1]=0,[2]=-2.65,[3]=0.6,[4]=0.6,[5]=0,[6]=0,},na="UI_1",t="UI",
},},},m={[1]=617.4,[2]=-120,[3]=1,[4]=1,[5]=0,[6]=0,},na="btn_2",t="btn",
},},cl="UI_battle_bppartner",na="UI_battle_bppartner",
}
 return UI_battle_bppartner